===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [32, 3]                   --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-1                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-1          [32, 1, 128, 133, 133]    --
│    │    └─Conv3d: 3-2                       [32, 8, 64, 64, 64]       296
│    │    └─BatchNorm3d: 3-3                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-4                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-5          [32, 8, 64, 69, 69]       --
│    │    └─Conv3d: 3-6                       [32, 8, 64, 64, 64]       2,312
│    │    └─BatchNorm3d: 3-7                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-8                    [32, 8, 64, 64, 64]       --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-2                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-9          [32, 1, 128, 133, 133]    --
│    │    └─Conv3d: 3-10                      [32, 8, 64, 64, 64]       296
│    │    └─BatchNorm3d: 3-11                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-12                   [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-13         [32, 8, 64, 69, 69]       --
│    │    └─Conv3d: 3-14                      [32, 8, 64, 64, 64]       2,312
│    │    └─BatchNorm3d: 3-15                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-16                   [32, 8, 64, 64, 64]       --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-3                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-17         [32, 8, 64, 66, 66]       --
│    │    └─Conv3d: 3-18                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-19                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-20                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-21         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-22                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-23                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-24                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-4                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-25         [32, 8, 64, 66, 66]       --
│    │    └─Conv3d: 3-26                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-27                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-28                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-29         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-30                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-31                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-32                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-5                    [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-33         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-34                      [32, 16, 16, 16, 16]      1,168
│    │    └─BatchNorm3d: 3-35                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-36                   [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-37         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-38                      [32, 16, 16, 16, 16]      2,320
│    │    └─BatchNorm3d: 3-39                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-40                   [32, 16, 16, 16, 16]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-6                    [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-41         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-42                      [32, 16, 16, 16, 16]      1,168
│    │    └─BatchNorm3d: 3-43                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-44                   [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-45         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-46                      [32, 16, 16, 16, 16]      2,320
│    │    └─BatchNorm3d: 3-47                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-48                   [32, 16, 16, 16, 16]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-7                    [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-49         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-50                      [32, 32, 8, 8, 8]         4,640
│    │    └─BatchNorm3d: 3-51                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-52                   [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-53         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-54                      [32, 32, 8, 8, 8]         9,248
│    │    └─BatchNorm3d: 3-55                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-56                   [32, 32, 8, 8, 8]         --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-8                    [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-57         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-58                      [32, 32, 8, 8, 8]         4,640
│    │    └─BatchNorm3d: 3-59                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-60                   [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-61         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-62                      [32, 32, 8, 8, 8]         9,248
│    │    └─BatchNorm3d: 3-63                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-64                   [32, 32, 8, 8, 8]         --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-9                    [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-65         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-66                      [32, 64, 8, 8, 8]         18,496
│    │    └─BatchNorm3d: 3-67                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-68                   [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-69         [32, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-70                      [32, 64, 8, 8, 8]         36,928
│    │    └─BatchNorm3d: 3-71                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-72                   [32, 64, 8, 8, 8]         --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-10                   [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-73         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-74                      [32, 64, 8, 8, 8]         18,496
│    │    └─BatchNorm3d: 3-75                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-76                   [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-77         [32, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-78                      [32, 64, 8, 8, 8]         36,928
│    │    └─BatchNorm3d: 3-79                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-80                   [32, 64, 8, 8, 8]         --
├─ModuleList: 1-11                            --                        --
│    └─Dropout: 2-11                          [32, 65536]               --
│    └─Linear: 2-12                           [32, 32]                  2,097,184
├─Output: 1-12                                [32, 3]                   99
│    └─Linear: 2-13                           [32, 3]                   99
===============================================================================================
Total params: 2,251,558
Trainable params: 2,251,558
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 49.46
===============================================================================================
Input size (MB): 536.87
Forward/backward pass size (MB): 5066.73
Params size (MB): 9.01
Estimated Total Size (MB): 5612.61
==============================================================================================================================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [32, 3]                   --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-1                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-1          [32, 1, 128, 133, 133]    --
│    │    └─Conv3d: 3-2                       [32, 8, 64, 64, 64]       296
│    │    └─BatchNorm3d: 3-3                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-4                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-5          [32, 8, 64, 69, 69]       --
│    │    └─Conv3d: 3-6                       [32, 8, 64, 64, 64]       2,312
│    │    └─BatchNorm3d: 3-7                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-8                    [32, 8, 64, 64, 64]       --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-2                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-9          [32, 1, 128, 133, 133]    --
│    │    └─Conv3d: 3-10                      [32, 8, 64, 64, 64]       296
│    │    └─BatchNorm3d: 3-11                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-12                   [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-13         [32, 8, 64, 69, 69]       --
│    │    └─Conv3d: 3-14                      [32, 8, 64, 64, 64]       2,312
│    │    └─BatchNorm3d: 3-15                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-16                   [32, 8, 64, 64, 64]       --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-3                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-17         [32, 8, 64, 66, 66]       --
│    │    └─Conv3d: 3-18                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-19                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-20                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-21         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-22                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-23                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-24                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-4                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-25         [32, 8, 64, 66, 66]       --
│    │    └─Conv3d: 3-26                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-27                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-28                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-29         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-30                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-31                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-32                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-5                    [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-33         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-34                      [32, 16, 16, 16, 16]      1,168
│    │    └─BatchNorm3d: 3-35                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-36                   [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-37         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-38                      [32, 16, 16, 16, 16]      2,320
│    │    └─BatchNorm3d: 3-39                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-40                   [32, 16, 16, 16, 16]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-6                    [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-41         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-42                      [32, 16, 16, 16, 16]      1,168
│    │    └─BatchNorm3d: 3-43                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-44                   [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-45         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-46                      [32, 16, 16, 16, 16]      2,320
│    │    └─BatchNorm3d: 3-47                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-48                   [32, 16, 16, 16, 16]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-7                    [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-49         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-50                      [32, 32, 8, 8, 8]         4,640
│    │    └─BatchNorm3d: 3-51                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-52                   [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-53         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-54                      [32, 32, 8, 8, 8]         9,248
│    │    └─BatchNorm3d: 3-55                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-56                   [32, 32, 8, 8, 8]         --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-8                    [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-57         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-58                      [32, 32, 8, 8, 8]         4,640
│    │    └─BatchNorm3d: 3-59                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-60                   [32, 32, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-61         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-62                      [32, 32, 8, 8, 8]         9,248
│    │    └─BatchNorm3d: 3-63                 [32, 32, 8, 8, 8]         64
│    │    └─LeakyReLU: 3-64                   [32, 32, 8, 8, 8]         --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-9                    [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-65         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-66                      [32, 64, 8, 8, 8]         18,496
│    │    └─BatchNorm3d: 3-67                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-68                   [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-69         [32, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-70                      [32, 64, 8, 8, 8]         36,928
│    │    └─BatchNorm3d: 3-71                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-72                   [32, 64, 8, 8, 8]         --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-10                   [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-73         [32, 32, 8, 10, 10]       --
│    │    └─Conv3d: 3-74                      [32, 64, 8, 8, 8]         18,496
│    │    └─BatchNorm3d: 3-75                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-76                   [32, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-77         [32, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-78                      [32, 64, 8, 8, 8]         36,928
│    │    └─BatchNorm3d: 3-79                 [32, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-80                   [32, 64, 8, 8, 8]         --
├─ModuleList: 1-11                            --                        --
│    └─Dropout: 2-11                          [32, 65536]               --
│    └─Linear: 2-12                           [32, 32]                  2,097,184
├─Output: 1-12                                [32, 3]                   99
│    └─Linear: 2-13                           [32, 3]                   99
===============================================================================================
Total params: 2,251,558
Trainable params: 2,251,558
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 49.46
===============================================================================================
Input size (MB): 536.87
Forward/backward pass size (MB): 5066.73
Params size (MB): 9.01
Estimated Total Size (MB): 5612.61
==============================================================================================================================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [16, 3]                   --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-1                    [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-1          [16, 1, 128, 132, 132]    --
│    │    └─Conv3d: 3-2                       [16, 16, 64, 64, 64]      416
│    │    └─BatchNorm3d: 3-3                  [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-4                    [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-5          [16, 16, 64, 68, 68]      --
│    │    └─Conv3d: 3-6                       [16, 16, 64, 64, 64]      6,416
│    │    └─BatchNorm3d: 3-7                  [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-8                    [16, 16, 64, 64, 64]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-2                    [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-9          [16, 1, 128, 132, 132]    --
│    │    └─Conv3d: 3-10                      [16, 16, 64, 64, 64]      416
│    │    └─BatchNorm3d: 3-11                 [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-12                   [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-13         [16, 16, 64, 68, 68]      --
│    │    └─Conv3d: 3-14                      [16, 16, 64, 64, 64]      6,416
│    │    └─BatchNorm3d: 3-15                 [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-16                   [16, 16, 64, 64, 64]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-3                    [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-17         [16, 16, 64, 67, 67]      --
│    │    └─Conv3d: 3-18                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-19                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-20                   [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-21         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-22                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-23                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-24                   [16, 16, 32, 32, 32]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-4                    [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-25         [16, 16, 64, 67, 67]      --
│    │    └─Conv3d: 3-26                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-27                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-28                   [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-29         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-30                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-31                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-32                   [16, 16, 32, 32, 32]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-5                    [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-33         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-34                      [16, 32, 16, 16, 16]      8,224
│    │    └─BatchNorm3d: 3-35                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-36                   [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-37         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-38                      [16, 32, 16, 16, 16]      16,416
│    │    └─BatchNorm3d: 3-39                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-40                   [16, 32, 16, 16, 16]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-6                    [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-41         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-42                      [16, 32, 16, 16, 16]      8,224
│    │    └─BatchNorm3d: 3-43                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-44                   [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-45         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-46                      [16, 32, 16, 16, 16]      16,416
│    │    └─BatchNorm3d: 3-47                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-48                   [16, 32, 16, 16, 16]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-7                    [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-49         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-50                      [16, 64, 8, 8, 8]         32,832
│    │    └─BatchNorm3d: 3-51                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-52                   [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-53         [16, 64, 8, 11, 11]       --
│    │    └─Conv3d: 3-54                      [16, 64, 8, 8, 8]         65,600
│    │    └─BatchNorm3d: 3-55                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-56                   [16, 64, 8, 8, 8]         --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-8                    [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-57         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-58                      [16, 64, 8, 8, 8]         32,832
│    │    └─BatchNorm3d: 3-59                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-60                   [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-61         [16, 64, 8, 11, 11]       --
│    │    └─Conv3d: 3-62                      [16, 64, 8, 8, 8]         65,600
│    │    └─BatchNorm3d: 3-63                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-64                   [16, 64, 8, 8, 8]         --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-9                    [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-65         [16, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-66                      [16, 128, 4, 4, 4]        73,856
│    │    └─BatchNorm3d: 3-67                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-68                   [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-69         [16, 128, 4, 6, 6]        --
│    │    └─Conv3d: 3-70                      [16, 128, 4, 4, 4]        147,584
│    │    └─BatchNorm3d: 3-71                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-72                   [16, 128, 4, 4, 4]        --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-10                   [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-73         [16, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-74                      [16, 128, 4, 4, 4]        73,856
│    │    └─BatchNorm3d: 3-75                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-76                   [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-77         [16, 128, 4, 6, 6]        --
│    │    └─Conv3d: 3-78                      [16, 128, 4, 4, 4]        147,584
│    │    └─BatchNorm3d: 3-79                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-80                   [16, 128, 4, 4, 4]        --
├─ModuleList: 1-11                            --                        --
│    └─Dropout: 2-11                          [16, 16384]               --
│    └─Linear: 2-12                           [16, 16]                  262,160
│    └─Dropout: 2-13                          [16, 16]                  --
│    └─Linear: 2-14                           [16, 16]                  272
│    └─Dropout: 2-15                          [16, 16]                  --
│    └─Linear: 2-16                           [16, 16]                  272
├─Output: 1-12                                [16, 3]                   51
│    └─Linear: 2-17                           [16, 3]                   51
===============================================================================================
Total params: 983,990
Trainable params: 983,990
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 71.23
===============================================================================================
Input size (MB): 268.44
Forward/backward pass size (MB): 5008.01
Params size (MB): 3.94
Estimated Total Size (MB): 5280.38
==============================================================================================================================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [16, 3]                   --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-1                    [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-1          [16, 1, 128, 132, 132]    --
│    │    └─Conv3d: 3-2                       [16, 16, 64, 64, 64]      416
│    │    └─BatchNorm3d: 3-3                  [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-4                    [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-5          [16, 16, 64, 68, 68]      --
│    │    └─Conv3d: 3-6                       [16, 16, 64, 64, 64]      6,416
│    │    └─BatchNorm3d: 3-7                  [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-8                    [16, 16, 64, 64, 64]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-2                    [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-9          [16, 1, 128, 132, 132]    --
│    │    └─Conv3d: 3-10                      [16, 16, 64, 64, 64]      416
│    │    └─BatchNorm3d: 3-11                 [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-12                   [16, 16, 64, 64, 64]      --
│    │    └─conv3d_padding_same: 3-13         [16, 16, 64, 68, 68]      --
│    │    └─Conv3d: 3-14                      [16, 16, 64, 64, 64]      6,416
│    │    └─BatchNorm3d: 3-15                 [16, 16, 64, 64, 64]      32
│    │    └─LeakyReLU: 3-16                   [16, 16, 64, 64, 64]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-3                    [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-17         [16, 16, 64, 67, 67]      --
│    │    └─Conv3d: 3-18                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-19                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-20                   [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-21         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-22                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-23                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-24                   [16, 16, 32, 32, 32]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-4                    [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-25         [16, 16, 64, 67, 67]      --
│    │    └─Conv3d: 3-26                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-27                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-28                   [16, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-29         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-30                      [16, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-31                 [16, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-32                   [16, 16, 32, 32, 32]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-5                    [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-33         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-34                      [16, 32, 16, 16, 16]      8,224
│    │    └─BatchNorm3d: 3-35                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-36                   [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-37         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-38                      [16, 32, 16, 16, 16]      16,416
│    │    └─BatchNorm3d: 3-39                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-40                   [16, 32, 16, 16, 16]      --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-6                    [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-41         [16, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-42                      [16, 32, 16, 16, 16]      8,224
│    │    └─BatchNorm3d: 3-43                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-44                   [16, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-45         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-46                      [16, 32, 16, 16, 16]      16,416
│    │    └─BatchNorm3d: 3-47                 [16, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-48                   [16, 32, 16, 16, 16]      --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-7                    [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-49         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-50                      [16, 64, 8, 8, 8]         32,832
│    │    └─BatchNorm3d: 3-51                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-52                   [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-53         [16, 64, 8, 11, 11]       --
│    │    └─Conv3d: 3-54                      [16, 64, 8, 8, 8]         65,600
│    │    └─BatchNorm3d: 3-55                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-56                   [16, 64, 8, 8, 8]         --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-8                    [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-57         [16, 32, 16, 19, 19]      --
│    │    └─Conv3d: 3-58                      [16, 64, 8, 8, 8]         32,832
│    │    └─BatchNorm3d: 3-59                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-60                   [16, 64, 8, 8, 8]         --
│    │    └─conv3d_padding_same: 3-61         [16, 64, 8, 11, 11]       --
│    │    └─Conv3d: 3-62                      [16, 64, 8, 8, 8]         65,600
│    │    └─BatchNorm3d: 3-63                 [16, 64, 8, 8, 8]         128
│    │    └─LeakyReLU: 3-64                   [16, 64, 8, 8, 8]         --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-9                    [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-65         [16, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-66                      [16, 128, 4, 4, 4]        73,856
│    │    └─BatchNorm3d: 3-67                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-68                   [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-69         [16, 128, 4, 6, 6]        --
│    │    └─Conv3d: 3-70                      [16, 128, 4, 4, 4]        147,584
│    │    └─BatchNorm3d: 3-71                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-72                   [16, 128, 4, 4, 4]        --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-10                   [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-73         [16, 64, 8, 10, 10]       --
│    │    └─Conv3d: 3-74                      [16, 128, 4, 4, 4]        73,856
│    │    └─BatchNorm3d: 3-75                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-76                   [16, 128, 4, 4, 4]        --
│    │    └─conv3d_padding_same: 3-77         [16, 128, 4, 6, 6]        --
│    │    └─Conv3d: 3-78                      [16, 128, 4, 4, 4]        147,584
│    │    └─BatchNorm3d: 3-79                 [16, 128, 4, 4, 4]        256
│    │    └─LeakyReLU: 3-80                   [16, 128, 4, 4, 4]        --
├─ModuleList: 1-11                            --                        --
│    └─Dropout: 2-11                          [16, 16384]               --
│    └─Linear: 2-12                           [16, 16]                  262,160
│    └─Dropout: 2-13                          [16, 16]                  --
│    └─Linear: 2-14                           [16, 16]                  272
│    └─Dropout: 2-15                          [16, 16]                  --
│    └─Linear: 2-16                           [16, 16]                  272
├─Output: 1-12                                [16, 3]                   51
│    └─Linear: 2-17                           [16, 3]                   51
===============================================================================================
Total params: 983,990
Trainable params: 983,990
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 71.23
===============================================================================================
Input size (MB): 268.44
Forward/backward pass size (MB): 5008.01
Params size (MB): 3.94
Estimated Total Size (MB): 5280.38
==============================================================================================================================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [8, 3]                    --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-1                    [8, 8, 64, 64, 64]        --
│    │    └─conv3d_padding_same: 3-1          [8, 1, 128, 132, 132]     --
│    │    └─Conv3d: 3-2                       [8, 8, 64, 64, 64]        208
│    │    └─BatchNorm3d: 3-3                  [8, 8, 64, 64, 64]        16
│    │    └─LeakyReLU: 3-4                    [8, 8, 64, 64, 64]        --
│    │    └─conv3d_padding_same: 3-5          [8, 8, 64, 68, 68]        --
│    │    └─Conv3d: 3-6                       [8, 8, 64, 64, 64]        1,608
│    │    └─BatchNorm3d: 3-7                  [8, 8, 64, 64, 64]        16
│    │    └─LeakyReLU: 3-8                    [8, 8, 64, 64, 64]        --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-2                    [8, 8, 64, 64, 64]        --
│    │    └─conv3d_padding_same: 3-9          [8, 1, 128, 132, 132]     --
│    │    └─Conv3d: 3-10                      [8, 8, 64, 64, 64]        208
│    │    └─BatchNorm3d: 3-11                 [8, 8, 64, 64, 64]        16
│    │    └─LeakyReLU: 3-12                   [8, 8, 64, 64, 64]        --
│    │    └─conv3d_padding_same: 3-13         [8, 8, 64, 68, 68]        --
│    │    └─Conv3d: 3-14                      [8, 8, 64, 64, 64]        1,608
│    │    └─BatchNorm3d: 3-15                 [8, 8, 64, 64, 64]        16
│    │    └─LeakyReLU: 3-16                   [8, 8, 64, 64, 64]        --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-3                    [8, 8, 32, 32, 32]        --
│    │    └─conv3d_padding_same: 3-17         [8, 8, 64, 68, 68]        --
│    │    └─Conv3d: 3-18                      [8, 8, 32, 32, 32]        1,608
│    │    └─BatchNorm3d: 3-19                 [8, 8, 32, 32, 32]        16
│    │    └─LeakyReLU: 3-20                   [8, 8, 32, 32, 32]        --
│    │    └─conv3d_padding_same: 3-21         [8, 8, 32, 36, 36]        --
│    │    └─Conv3d: 3-22                      [8, 8, 32, 32, 32]        1,608
│    │    └─BatchNorm3d: 3-23                 [8, 8, 32, 32, 32]        16
│    │    └─LeakyReLU: 3-24                   [8, 8, 32, 32, 32]        --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-4                    [8, 8, 32, 32, 32]        --
│    │    └─conv3d_padding_same: 3-25         [8, 8, 64, 68, 68]        --
│    │    └─Conv3d: 3-26                      [8, 8, 32, 32, 32]        1,608
│    │    └─BatchNorm3d: 3-27                 [8, 8, 32, 32, 32]        16
│    │    └─LeakyReLU: 3-28                   [8, 8, 32, 32, 32]        --
│    │    └─conv3d_padding_same: 3-29         [8, 8, 32, 36, 36]        --
│    │    └─Conv3d: 3-30                      [8, 8, 32, 32, 32]        1,608
│    │    └─BatchNorm3d: 3-31                 [8, 8, 32, 32, 32]        16
│    │    └─LeakyReLU: 3-32                   [8, 8, 32, 32, 32]        --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-5                    [8, 16, 16, 16, 16]       --
│    │    └─conv3d_padding_same: 3-33         [8, 8, 32, 35, 35]        --
│    │    └─Conv3d: 3-34                      [8, 16, 16, 16, 16]       2,064
│    │    └─BatchNorm3d: 3-35                 [8, 16, 16, 16, 16]       32
│    │    └─LeakyReLU: 3-36                   [8, 16, 16, 16, 16]       --
│    │    └─conv3d_padding_same: 3-37         [8, 16, 16, 19, 19]       --
│    │    └─Conv3d: 3-38                      [8, 16, 16, 16, 16]       4,112
│    │    └─BatchNorm3d: 3-39                 [8, 16, 16, 16, 16]       32
│    │    └─LeakyReLU: 3-40                   [8, 16, 16, 16, 16]       --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-6                    [8, 16, 16, 16, 16]       --
│    │    └─conv3d_padding_same: 3-41         [8, 8, 32, 35, 35]        --
│    │    └─Conv3d: 3-42                      [8, 16, 16, 16, 16]       2,064
│    │    └─BatchNorm3d: 3-43                 [8, 16, 16, 16, 16]       32
│    │    └─LeakyReLU: 3-44                   [8, 16, 16, 16, 16]       --
│    │    └─conv3d_padding_same: 3-45         [8, 16, 16, 19, 19]       --
│    │    └─Conv3d: 3-46                      [8, 16, 16, 16, 16]       4,112
│    │    └─BatchNorm3d: 3-47                 [8, 16, 16, 16, 16]       32
│    │    └─LeakyReLU: 3-48                   [8, 16, 16, 16, 16]       --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-7                    [8, 32, 8, 8, 8]          --
│    │    └─conv3d_padding_same: 3-49         [8, 16, 16, 19, 19]       --
│    │    └─Conv3d: 3-50                      [8, 32, 8, 8, 8]          8,224
│    │    └─BatchNorm3d: 3-51                 [8, 32, 8, 8, 8]          64
│    │    └─LeakyReLU: 3-52                   [8, 32, 8, 8, 8]          --
│    │    └─conv3d_padding_same: 3-53         [8, 32, 8, 11, 11]        --
│    │    └─Conv3d: 3-54                      [8, 32, 8, 8, 8]          16,416
│    │    └─BatchNorm3d: 3-55                 [8, 32, 8, 8, 8]          64
│    │    └─LeakyReLU: 3-56                   [8, 32, 8, 8, 8]          --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-8                    [8, 32, 8, 8, 8]          --
│    │    └─conv3d_padding_same: 3-57         [8, 16, 16, 19, 19]       --
│    │    └─Conv3d: 3-58                      [8, 32, 8, 8, 8]          8,224
│    │    └─BatchNorm3d: 3-59                 [8, 32, 8, 8, 8]          64
│    │    └─LeakyReLU: 3-60                   [8, 32, 8, 8, 8]          --
│    │    └─conv3d_padding_same: 3-61         [8, 32, 8, 11, 11]        --
│    │    └─Conv3d: 3-62                      [8, 32, 8, 8, 8]          16,416
│    │    └─BatchNorm3d: 3-63                 [8, 32, 8, 8, 8]          64
│    │    └─LeakyReLU: 3-64                   [8, 32, 8, 8, 8]          --
├─ModuleList: 1-9                             --                        (recursive)
│    └─conv_block_two: 2-9                    [8, 64, 4, 4, 4]          --
│    │    └─conv3d_padding_same: 3-65         [8, 32, 8, 10, 10]        --
│    │    └─Conv3d: 3-66                      [8, 64, 4, 4, 4]          18,496
│    │    └─BatchNorm3d: 3-67                 [8, 64, 4, 4, 4]          128
│    │    └─LeakyReLU: 3-68                   [8, 64, 4, 4, 4]          --
│    │    └─conv3d_padding_same: 3-69         [8, 64, 4, 6, 6]          --
│    │    └─Conv3d: 3-70                      [8, 64, 4, 4, 4]          36,928
│    │    └─BatchNorm3d: 3-71                 [8, 64, 4, 4, 4]          128
│    │    └─LeakyReLU: 3-72                   [8, 64, 4, 4, 4]          --
├─ModuleList: 1-10                            --                        (recursive)
│    └─conv_block_two: 2-10                   [8, 64, 4, 4, 4]          --
│    │    └─conv3d_padding_same: 3-73         [8, 32, 8, 10, 10]        --
│    │    └─Conv3d: 3-74                      [8, 64, 4, 4, 4]          18,496
│    │    └─BatchNorm3d: 3-75                 [8, 64, 4, 4, 4]          128
│    │    └─LeakyReLU: 3-76                   [8, 64, 4, 4, 4]          --
│    │    └─conv3d_padding_same: 3-77         [8, 64, 4, 6, 6]          --
│    │    └─Conv3d: 3-78                      [8, 64, 4, 4, 4]          36,928
│    │    └─BatchNorm3d: 3-79                 [8, 64, 4, 4, 4]          128
│    │    └─LeakyReLU: 3-80                   [8, 64, 4, 4, 4]          --
├─ModuleList: 1-11                            --                        --
│    └─Dropout: 2-11                          [8, 8192]                 --
│    └─Linear: 2-12                           [8, 32]                   262,176
│    └─Dropout: 2-13                          [8, 32]                   --
│    └─Linear: 2-14                           [8, 32]                   1,056
├─Output: 1-12                                [8, 3]                    99
│    └─Linear: 2-15                           [8, 3]                    99
===============================================================================================
Total params: 446,998
Trainable params: 446,998
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 9.97
===============================================================================================
Input size (MB): 134.22
Forward/backward pass size (MB): 1252.00
Params size (MB): 1.79
Estimated Total Size (MB): 1388.01
===============================================================================================