===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [32, 3]                   --
├─ModuleList: 1-7                             --                        (recursive)
│    └─conv_block_two: 2-1                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-1          [32, 1, 128, 133, 133]    --
│    │    └─Conv3d: 3-2                       [32, 8, 64, 64, 64]       296
│    │    └─BatchNorm3d: 3-3                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-4                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-5          [32, 8, 64, 69, 69]       --
│    │    └─Conv3d: 3-6                       [32, 8, 64, 64, 64]       2,312
│    │    └─BatchNorm3d: 3-7                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-8                    [32, 8, 64, 64, 64]       --
├─ModuleList: 1-8                             --                        (recursive)
│    └─conv_block_two: 2-2                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-9          [32, 1, 128, 133, 133]    --
│    │    └─Conv3d: 3-10                      [32, 8, 64, 64, 64]       296
│    │    └─BatchNorm3d: 3-11                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-12                   [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-13         [32, 8, 64, 69, 69]       --
│    │    └─Conv3d: 3-14                      [32, 8, 64, 64, 64]       2,312
│    │    └─BatchNorm3d: 3-15                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-16                   [32, 8, 64, 64, 64]       --
├─ModuleList: 1-7                             --                        (recursive)
│    └─conv_block_two: 2-3                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-17         [32, 8, 64, 66, 66]       --
│    │    └─Conv3d: 3-18                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-19                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-20                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-21         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-22                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-23                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-24                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-8                             --                        (recursive)
│    └─conv_block_two: 2-4                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-25         [32, 8, 64, 66, 66]       --
│    │    └─Conv3d: 3-26                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-27                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-28                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-29         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-30                      [32, 8, 32, 32, 32]       584
│    │    └─BatchNorm3d: 3-31                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-32                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-7                             --                        (recursive)
│    └─conv_block_two: 2-5                    [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-33         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-34                      [32, 16, 16, 16, 16]      1,168
│    │    └─BatchNorm3d: 3-35                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-36                   [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-37         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-38                      [32, 16, 16, 16, 16]      2,320
│    │    └─BatchNorm3d: 3-39                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-40                   [32, 16, 16, 16, 16]      --
├─ModuleList: 1-8                             --                        (recursive)
│    └─conv_block_two: 2-6                    [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-41         [32, 8, 32, 34, 34]       --
│    │    └─Conv3d: 3-42                      [32, 16, 16, 16, 16]      1,168
│    │    └─BatchNorm3d: 3-43                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-44                   [32, 16, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-45         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-46                      [32, 16, 16, 16, 16]      2,320
│    │    └─BatchNorm3d: 3-47                 [32, 16, 16, 16, 16]      32
│    │    └─LeakyReLU: 3-48                   [32, 16, 16, 16, 16]      --
├─ModuleList: 1-7                             --                        (recursive)
│    └─conv_block_two: 2-7                    [32, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-49         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-50                      [32, 32, 16, 16, 16]      4,640
│    │    └─BatchNorm3d: 3-51                 [32, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-52                   [32, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-53         [32, 32, 16, 18, 18]      --
│    │    └─Conv3d: 3-54                      [32, 32, 16, 16, 16]      9,248
│    │    └─BatchNorm3d: 3-55                 [32, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-56                   [32, 32, 16, 16, 16]      --
├─ModuleList: 1-8                             --                        (recursive)
│    └─conv_block_two: 2-8                    [32, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-57         [32, 16, 16, 18, 18]      --
│    │    └─Conv3d: 3-58                      [32, 32, 16, 16, 16]      4,640
│    │    └─BatchNorm3d: 3-59                 [32, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-60                   [32, 32, 16, 16, 16]      --
│    │    └─conv3d_padding_same: 3-61         [32, 32, 16, 18, 18]      --
│    │    └─Conv3d: 3-62                      [32, 32, 16, 16, 16]      9,248
│    │    └─BatchNorm3d: 3-63                 [32, 32, 16, 16, 16]      64
│    │    └─LeakyReLU: 3-64                   [32, 32, 16, 16, 16]      --
├─ModuleList: 1-9                             --                        --
│    └─Dropout: 2-9                           [32, 262144]              --
│    └─Linear: 2-10                           [32, 32]                  8,388,640
├─Output: 1-10                                [32, 3]                   99
│    └─Linear: 2-11                           [32, 3]                   99
===============================================================================================
Total params: 8,431,654
Trainable params: 8,431,654
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 51.03
===============================================================================================
Input size (MB): 536.87
Forward/backward pass size (MB): 5234.50
Params size (MB): 33.73
Estimated Total Size (MB): 5805.10
===============================================================================================