===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
Dual_DCNN_LReLU                               [32, 3]                   --
├─ModuleList: 1-5                             --                        (recursive)
│    └─conv_block_two: 2-1                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-1          [32, 1, 128, 134, 134]    --
│    │    └─Conv3d: 3-2                       [32, 8, 64, 64, 64]       400
│    │    └─BatchNorm3d: 3-3                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-4                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-5          [32, 8, 64, 70, 70]       --
│    │    └─Conv3d: 3-6                       [32, 8, 64, 64, 64]       3,144
│    │    └─BatchNorm3d: 3-7                  [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-8                    [32, 8, 64, 64, 64]       --
├─ModuleList: 1-6                             --                        (recursive)
│    └─conv_block_two: 2-2                    [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-9          [32, 1, 128, 134, 134]    --
│    │    └─Conv3d: 3-10                      [32, 8, 64, 64, 64]       400
│    │    └─BatchNorm3d: 3-11                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-12                   [32, 8, 64, 64, 64]       --
│    │    └─conv3d_padding_same: 3-13         [32, 8, 64, 70, 70]       --
│    │    └─Conv3d: 3-14                      [32, 8, 64, 64, 64]       3,144
│    │    └─BatchNorm3d: 3-15                 [32, 8, 64, 64, 64]       16
│    │    └─LeakyReLU: 3-16                   [32, 8, 64, 64, 64]       --
├─ModuleList: 1-5                             --                        (recursive)
│    └─conv_block_two: 2-3                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-17         [32, 8, 64, 68, 68]       --
│    │    └─Conv3d: 3-18                      [32, 8, 32, 32, 32]       1,608
│    │    └─BatchNorm3d: 3-19                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-20                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-21         [32, 8, 32, 36, 36]       --
│    │    └─Conv3d: 3-22                      [32, 8, 32, 32, 32]       1,608
│    │    └─BatchNorm3d: 3-23                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-24                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-6                             --                        (recursive)
│    └─conv_block_two: 2-4                    [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-25         [32, 8, 64, 68, 68]       --
│    │    └─Conv3d: 3-26                      [32, 8, 32, 32, 32]       1,608
│    │    └─BatchNorm3d: 3-27                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-28                   [32, 8, 32, 32, 32]       --
│    │    └─conv3d_padding_same: 3-29         [32, 8, 32, 36, 36]       --
│    │    └─Conv3d: 3-30                      [32, 8, 32, 32, 32]       1,608
│    │    └─BatchNorm3d: 3-31                 [32, 8, 32, 32, 32]       16
│    │    └─LeakyReLU: 3-32                   [32, 8, 32, 32, 32]       --
├─ModuleList: 1-5                             --                        (recursive)
│    └─conv_block_two: 2-5                    [32, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-33         [32, 8, 32, 35, 35]       --
│    │    └─Conv3d: 3-34                      [32, 16, 32, 32, 32]      2,064
│    │    └─BatchNorm3d: 3-35                 [32, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-36                   [32, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-37         [32, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-38                      [32, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-39                 [32, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-40                   [32, 16, 32, 32, 32]      --
├─ModuleList: 1-6                             --                        (recursive)
│    └─conv_block_two: 2-6                    [32, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-41         [32, 8, 32, 35, 35]       --
│    │    └─Conv3d: 3-42                      [32, 16, 32, 32, 32]      2,064
│    │    └─BatchNorm3d: 3-43                 [32, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-44                   [32, 16, 32, 32, 32]      --
│    │    └─conv3d_padding_same: 3-45         [32, 16, 32, 35, 35]      --
│    │    └─Conv3d: 3-46                      [32, 16, 32, 32, 32]      4,112
│    │    └─BatchNorm3d: 3-47                 [32, 16, 32, 32, 32]      32
│    │    └─LeakyReLU: 3-48                   [32, 16, 32, 32, 32]      --
├─ModuleList: 1-7                             --                        --
│    └─Dropout: 2-7                           [32, 1048576]             --
│    └─Linear: 2-8                            [32, 32]                  33,554,464
├─Output: 1-8                                 [32, 3]                   99
│    └─Linear: 2-9                            [32, 3]                   99
===============================================================================================
Total params: 33,580,790
Trainable params: 33,580,790
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 80.23
===============================================================================================
Input size (MB): 536.87
Forward/backward pass size (MB): 5905.59
Params size (MB): 134.32
Estimated Total Size (MB): 6576.78
===============================================================================================